Revit 2027 API
ElementIntersectsElementFilter(Element) Constructor
 Constructs a filter to match elements which intersect the given element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementIntersectsElementFilter(
	Element element
)
Public Sub New (
	element As Element
)
public:
ElementIntersectsElementFilter(
	Element^ element
)
new :
        element : Element -> ElementIntersectsElementFilter
Parameters
element Element
 The element to check for intersection.
Exceptions
Exception | Condition
ArgumentException |  The category of the element is not supported for element intersection filters. -or- The element is not supported for element intersection filters.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ElementIntersectsElementFilter Class
ElementIntersectsElementFilter Overload
Autodesk.Revit.DB Namespace